zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/i2sc.h
typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t RXOR:1;                    /**< bit:      2  Receive Overrun Status Clear                  */
    uint32_t :3;                        /**< bit:   3..5  Reserved                                      */
    uint32_t TXUR:1;                    /**< bit:      6  Transmit Underrun Status Clear                */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t RXORCH:2;                  /**< bit:   8..9  Receive Overrun Per Channel Status Clear      */
    uint32_t :10;                       /**< bit: 10..19  Reserved                                      */
    uint32_t TXURCH:2;                  /**< bit: 20..21  Transmit Underrun Per Channel Status Clear    */
    uint32_t :10;                       /**< bit: 22..31  Reserved                                      */
  };
  uint32_t w;
} __I2SC_SCR_bits_t;

#define I2SC_SCR_RXOR_Pos                     (2)                                            /**< (I2SC_SCR) Receive Overrun Status Clear Position */
#define I2SC_SCR_RXOR_Msk                     (0x1U << I2SC_SCR_RXOR_Pos)                    /**< (I2SC_SCR) Receive Overrun Status Clear Mask */
#define I2SC_SCR_TXUR_Pos                     (6)                                            /**< (I2SC_SCR) Transmit Underrun Status Clear Position */
#define I2SC_SCR_TXUR_Msk                     (0x1U << I2SC_SCR_TXUR_Pos)                    /**< (I2SC_SCR) Transmit Underrun Status Clear Mask */
#define I2SC_SCR_RXORCH_Pos                   (8)                                            /**< (I2SC_SCR) Receive Overrun Per Channel Status Clear Position */
#define I2SC_SCR_RXORCH_Msk                   (0x3U << I2SC_SCR_RXORCH_Pos)                  /**< (I2SC_SCR) Receive Overrun Per Channel Status Clear Mask */
#define I2SC_SCR_RXORCH(value)                (I2SC_SCR_RXORCH_Msk & ((value) << I2SC_SCR_RXORCH_Pos))
#define I2SC_SCR_TXURCH_Pos                   (20)                                           /**< (I2SC_SCR) Transmit Underrun Per Channel Status Clear Position */
#define I2SC_SCR_TXURCH_Msk                   (0x3U << I2SC_SCR_TXURCH_Pos)                  /**< (I2SC_SCR) Transmit Underrun Per Channel Status Clear Mask */
#define I2SC_SCR_TXURCH(value)                (I2SC_SCR_TXURCH_Msk & ((value) << I2SC_SCR_TXURCH_Pos))
#define I2SC_SCR_Msk                          (0x00300344UL)                                 /**< (I2SC_SCR) Register Mask  */

/* -------- I2SC_SSR : (I2SC Offset: 0x10) (/W 32) Status Set Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t RXOR:1;                    /**< bit:      2  Receive Overrun Status Set                    */
    uint32_t :3;                        /**< bit:   3..5  Reserved                                      */
    uint32_t TXUR:1;                    /**< bit:      6  Transmit Underrun Status Set                  */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t RXORCH:2;                  /**< bit:   8..9  Receive Overrun Per Channel Status Set        */
    uint32_t :10;                       /**< bit: 10..19  Reserved                                      */
    uint32_t TXURCH:2;                  /**< bit: 20..21  Transmit Underrun Per Channel Status Set      */
    uint32_t :10;                       /**< bit: 22..31  Reserved                                      */
  };
  uint32_t w;
} __I2SC_SSR_bits_t;

#define I2SC_SSR_RXOR_Pos                     (2)                                            /**< (I2SC_SSR) Receive Overrun Status Set Position */
#define I2SC_SSR_RXOR_Msk                     (0x1U << I2SC_SSR_RXOR_Pos)                    /**< (I2SC_SSR) Receive Overrun Status Set Mask */
#define I2SC_SSR_TXUR_Pos                     (6)                                            /**< (I2SC_SSR) Transmit Underrun Status Set Position */
#define I2SC_SSR_TXUR_Msk                     (0x1U << I2SC_SSR_TXUR_Pos)                    /**< (I2SC_SSR) Transmit Underrun Status Set Mask */
#define I2SC_SSR_RXORCH_Pos                   (8)                                            /**< (I2SC_SSR) Receive Overrun Per Channel Status Set Position */
#define I2SC_SSR_RXORCH_Msk                   (0x3U << I2SC_SSR_RXORCH_Pos)                  /**< (I2SC_SSR) Receive Overrun Per Channel Status Set Mask */
#define I2SC_SSR_RXORCH(value)                (I2SC_SSR_RXORCH_Msk & ((value) << I2SC_SSR_RXORCH_Pos))
#define I2SC_SSR_TXURCH_Pos                   (20)                                           /**< (I2SC_SSR) Transmit Underrun Per Channel Status Set Position */
#define I2SC_SSR_TXURCH_Msk                   (0x3U << I2SC_SSR_TXURCH_Pos)                  /**< (I2SC_SSR) Transmit Underrun Per Channel Status Set Mask */
#define I2SC_SSR_TXURCH(value)                (I2SC_SSR_TXURCH_Msk & ((value) << I2SC_SSR_TXURCH_Pos))
#define I2SC_SSR_Msk                          (0x00300344UL)                                 /**< (I2SC_SSR) Register Mask  */

/* -------- I2SC_IER : (I2SC Offset: 0x14) (/W 32) Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t RXRDY:1;                   /**< bit:      1  Receiver Ready Interrupt Enable               */
    uint32_t RXOR:1;                    /**< bit:      2  Receiver Overrun Interrupt Enable             */
    uint32_t :2;                        /**< bit:   3..4  Reserved                                      */
    uint32_t TXRDY:1;                   /**< bit:      5  Transmit Ready Interrupt Enable               */
    uint32_t TXUR:1;                    /**< bit:      6  Transmit Underflow Interrupt Enable           */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __I2SC_IER_bits_t;

#define I2SC_IER_RXRDY_Pos                    (1)                                            /**< (I2SC_IER) Receiver Ready Interrupt Enable Position */
#define I2SC_IER_RXRDY_Msk                    (0x1U << I2SC_IER_RXRDY_Pos)                   /**< (I2SC_IER) Receiver Ready Interrupt Enable Mask */
#define I2SC_IER_RXOR_Pos                     (2)                                            /**< (I2SC_IER) Receiver Overrun Interrupt Enable Position */
#define I2SC_IER_RXOR_Msk                     (0x1U << I2SC_IER_RXOR_Pos)                    /**< (I2SC_IER) Receiver Overrun Interrupt Enable Mask */
#define I2SC_IER_TXRDY_Pos                    (5)                                            /**< (I2SC_IER) Transmit Ready Interrupt Enable Position */
#define I2SC_IER_TXRDY_Msk                    (0x1U << I2SC_IER_TXRDY_Pos)                   /**< (I2SC_IER) Transmit Ready Interrupt Enable Mask */
#define I2SC_IER_TXUR_Pos                     (6)                                            /**< (I2SC_IER) Transmit Underflow Interrupt Enable Position */
#define I2SC_IER_TXUR_Msk                     (0x1U << I2SC_IER_TXUR_Pos)                    /**< (I2SC_IER) Transmit Underflow Interrupt Enable Mask */
#define I2SC_IER_Msk                          (0x00000066UL)                                 /**< (I2SC_IER) Register Mask  */

