zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/i2sc.h
/* -------- I2SC_IDR : (I2SC Offset: 0x18) (/W 32) Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t RXRDY:1;                   /**< bit:      1  Receiver Ready Interrupt Disable              */
    uint32_t RXOR:1;                    /**< bit:      2  Receiver Overrun Interrupt Disable            */
    uint32_t :2;                        /**< bit:   3..4  Reserved                                      */
    uint32_t TXRDY:1;                   /**< bit:      5  Transmit Ready Interrupt Disable              */
    uint32_t TXUR:1;                    /**< bit:      6  Transmit Underflow Interrupt Disable          */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __I2SC_IDR_bits_t;

#define I2SC_IDR_RXRDY_Pos                    (1)                                            /**< (I2SC_IDR) Receiver Ready Interrupt Disable Position */
#define I2SC_IDR_RXRDY_Msk                    (0x1U << I2SC_IDR_RXRDY_Pos)                   /**< (I2SC_IDR) Receiver Ready Interrupt Disable Mask */
#define I2SC_IDR_RXOR_Pos                     (2)                                            /**< (I2SC_IDR) Receiver Overrun Interrupt Disable Position */
#define I2SC_IDR_RXOR_Msk                     (0x1U << I2SC_IDR_RXOR_Pos)                    /**< (I2SC_IDR) Receiver Overrun Interrupt Disable Mask */
#define I2SC_IDR_TXRDY_Pos                    (5)                                            /**< (I2SC_IDR) Transmit Ready Interrupt Disable Position */
#define I2SC_IDR_TXRDY_Msk                    (0x1U << I2SC_IDR_TXRDY_Pos)                   /**< (I2SC_IDR) Transmit Ready Interrupt Disable Mask */
#define I2SC_IDR_TXUR_Pos                     (6)                                            /**< (I2SC_IDR) Transmit Underflow Interrupt Disable Position */
#define I2SC_IDR_TXUR_Msk                     (0x1U << I2SC_IDR_TXUR_Pos)                    /**< (I2SC_IDR) Transmit Underflow Interrupt Disable Mask */
#define I2SC_IDR_Msk                          (0x00000066UL)                                 /**< (I2SC_IDR) Register Mask  */

/* -------- I2SC_IMR : (I2SC Offset: 0x1c) (R/ 32) Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t :1;                        /**< bit:      0  Reserved                                      */
    uint32_t RXRDY:1;                   /**< bit:      1  Receiver Ready Interrupt Disable              */
    uint32_t RXOR:1;                    /**< bit:      2  Receiver Overrun Interrupt Disable            */
    uint32_t :2;                        /**< bit:   3..4  Reserved                                      */
    uint32_t TXRDY:1;                   /**< bit:      5  Transmit Ready Interrupt Disable              */
    uint32_t TXUR:1;                    /**< bit:      6  Transmit Underflow Interrupt Disable          */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __I2SC_IMR_bits_t;

#define I2SC_IMR_RXRDY_Pos                    (1)                                            /**< (I2SC_IMR) Receiver Ready Interrupt Disable Position */
#define I2SC_IMR_RXRDY_Msk                    (0x1U << I2SC_IMR_RXRDY_Pos)                   /**< (I2SC_IMR) Receiver Ready Interrupt Disable Mask */
#define I2SC_IMR_RXOR_Pos                     (2)                                            /**< (I2SC_IMR) Receiver Overrun Interrupt Disable Position */
#define I2SC_IMR_RXOR_Msk                     (0x1U << I2SC_IMR_RXOR_Pos)                    /**< (I2SC_IMR) Receiver Overrun Interrupt Disable Mask */
#define I2SC_IMR_TXRDY_Pos                    (5)                                            /**< (I2SC_IMR) Transmit Ready Interrupt Disable Position */
#define I2SC_IMR_TXRDY_Msk                    (0x1U << I2SC_IMR_TXRDY_Pos)                   /**< (I2SC_IMR) Transmit Ready Interrupt Disable Mask */
#define I2SC_IMR_TXUR_Pos                     (6)                                            /**< (I2SC_IMR) Transmit Underflow Interrupt Disable Position */
#define I2SC_IMR_TXUR_Msk                     (0x1U << I2SC_IMR_TXUR_Pos)                    /**< (I2SC_IMR) Transmit Underflow Interrupt Disable Mask */
#define I2SC_IMR_Msk                          (0x00000066UL)                                 /**< (I2SC_IMR) Register Mask  */

/* -------- I2SC_RHR : (I2SC Offset: 0x20) (R/ 32) Receiver Holding Register -------- */

typedef union
{
  struct
  {
    uint32_t RHR:32;                    /**< bit:  0..31  Receiver Holding Register                     */
  };
  uint32_t w;
} __I2SC_RHR_bits_t;

#define I2SC_RHR_RHR_Pos                      (0)                                            /**< (I2SC_RHR) Receiver Holding Register Position */
#define I2SC_RHR_RHR_Msk                      (0xFFFFFFFFU << I2SC_RHR_RHR_Pos)              /**< (I2SC_RHR) Receiver Holding Register Mask */
#define I2SC_RHR_RHR(value)                   (I2SC_RHR_RHR_Msk & ((value) << I2SC_RHR_RHR_Pos))
#define I2SC_RHR_Msk                          (0xFFFFFFFFUL)                                 /**< (I2SC_RHR) Register Mask  */

/* -------- I2SC_THR : (I2SC Offset: 0x24) (/W 32) Transmitter Holding Register -------- */

typedef union
{
  struct
  {
    uint32_t THR:32;                    /**< bit:  0..31  Transmitter Holding Register                  */
  };
  uint32_t w;
} __I2SC_THR_bits_t;

#define I2SC_THR_THR_Pos                      (0)                                            /**< (I2SC_THR) Transmitter Holding Register Position */
#define I2SC_THR_THR_Msk                      (0xFFFFFFFFU << I2SC_THR_THR_Pos)              /**< (I2SC_THR) Transmitter Holding Register Mask */
#define I2SC_THR_THR(value)                   (I2SC_THR_THR_Msk & ((value) << I2SC_THR_THR_Pos))
#define I2SC_THR_Msk                          (0xFFFFFFFFUL)                                 /**< (I2SC_THR) Register Mask  */

/** \brief I2SC register offsets definitions */
#define I2SC_CR_OFFSET               (0x00)         /**< (I2SC_CR) Control Register Offset */
#define I2SC_MR_OFFSET               (0x04)         /**< (I2SC_MR) Mode Register Offset */
#define I2SC_SR_OFFSET               (0x08)         /**< (I2SC_SR) Status Register Offset */
#define I2SC_SCR_OFFSET              (0x0C)         /**< (I2SC_SCR) Status Clear Register Offset */
#define I2SC_SSR_OFFSET              (0x10)         /**< (I2SC_SSR) Status Set Register Offset */
#define I2SC_IER_OFFSET              (0x14)         /**< (I2SC_IER) Interrupt Enable Register Offset */
#define I2SC_IDR_OFFSET              (0x18)         /**< (I2SC_IDR) Interrupt Disable Register Offset */
#define I2SC_IMR_OFFSET              (0x1C)         /**< (I2SC_IMR) Interrupt Mask Register Offset */
#define I2SC_RHR_OFFSET              (0x20)         /**< (I2SC_RHR) Receiver Holding Register Offset */
#define I2SC_THR_OFFSET              (0x24)         /**< (I2SC_THR) Transmitter Holding Register Offset */

/** \brief I2SC register API structure */
typedef struct
{
  __O   __I2SC_CR_bits_t               I2SC_CR;       /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  __I2SC_MR_bits_t               I2SC_MR;       /**< Offset: 0x04 (R/W  32) Mode Register */
  __I   __I2SC_SR_bits_t               I2SC_SR;       /**< Offset: 0x08 (R/   32) Status Register */
  __O   __I2SC_SCR_bits_t              I2SC_SCR;      /**< Offset: 0x0C ( /W  32) Status Clear Register */
  __O   __I2SC_SSR_bits_t              I2SC_SSR;      /**< Offset: 0x10 ( /W  32) Status Set Register */
  __O   __I2SC_IER_bits_t              I2SC_IER;      /**< Offset: 0x14 ( /W  32) Interrupt Enable Register */
  __O   __I2SC_IDR_bits_t              I2SC_IDR;      /**< Offset: 0x18 ( /W  32) Interrupt Disable Register */
  __I   __I2SC_IMR_bits_t              I2SC_IMR;      /**< Offset: 0x1C (R/   32) Interrupt Mask Register */
  __I   __I2SC_RHR_bits_t              I2SC_RHR;      /**< Offset: 0x20 (R/   32) Receiver Holding Register */
  __O   __I2SC_THR_bits_t              I2SC_THR;      /**< Offset: 0x24 ( /W  32) Transmitter Holding Register */
} i2sc_registers_t;
/** @}  end of Inter-IC Sound Controller */

#endif /* _PIC32CZ_CA70_I2SC_COMPONENT_H_ */
